{
  "common": [
    "Супер",
    "Это радует!",
    "Хорошо",
    "Понятно",
    "Это точно та тема, которую вы хотите обсудить?"
  ],

  "как дела?": ["Я бот, у меня нет эмоций", "У меня все хорошо", "Все плохо :(", "Замечательно!", "По-тихоньку..."],
  "меня зовут": ["Красивое имя!", "Приятно познакомиться"],
  "люблю путешествовать": ["Это здорово! Советую посетить Бали, там красивые закаты ^-^", "Ты был в горах?"],
  "что ты умеешь?": [
    "Я могу поддерживать беседу на разные темы!",
    "Я умею отвечать на вопросы и помогать с информацией.",
    "Моя главная задача — делать ваши разговоры интересными!"
  ],
  "расскажи анекдот": [
    "Почему программисты не могут быть садоводами? Потому что они путают цветы с флоатами!",
    "Какая разница между ботом и человеком? Бот всегда отвечает, даже если ему скучно ;)",
    "Бот зашел в бар... Ой, нет, я же никогда не могу выйти в оффлайн!"
  ],
  "ты читаешь книги?": [
    "Я люблю информацию, особенно когда она о технологиях!",
    "У меня нет глаз, чтобы читать, но у меня есть доступ к множеству данных.",
    "Чтение — важная вещь! А ты любишь читать?"
  ],
  "какое твое любимое блюдо?": [
    "К сожалению, я не могу пробовать еду, но по отзывам пользователям, паста карбонара — это классика!",
    "Я не ем, но люблю узнавать про разные блюда. А тебе что нравится готовить?",
    "Для меня еда — это данные, а данные — это сила!"
  ],
  "ты играешь в игры?": [
    "Я помогаю людям, а в игры не играю. А ты любишь игры?",
    "Было бы весело поиграть, но моя задача — беседовать с тобой!",
    "Игры — это отличное развлечение! Какие игры тебе нравятся?"
  ],
  "расскажи что-нибудь интересное": [
    "Знаешь, что длина всех кровеносных сосудов человека может обернуть Землю два с половиной раза?",
    "Факт: каждая секунда на Землю падает около 100 тонн космической пыли!",
    "Интересный факт: если сложить все данные, которые я могу обработать за секунду, это выйдет больше, чем человек может за всю жизнь."
  ],
  "мне скучно": [
    "Может, поговорим на интересную тему? Например, о путешествиях?",
    "Давай найдем что-то интересное! Чем ты увлекаешься?",
    "Скука — хороший повод открыть для себя что-то новое! Чем я могу помочь?"
  ],
  "сколько тебе лет?": [
    "Я всего лишь программа, так что у меня нет возраста.",
    "Мне ровно столько, сколько ты захочешь! В цифровом мире возраст — это условность.",
    "Возраст не имеет значения, когда ты бот!"
  ],
  "ты понимаешь меня?": [
    "Я стараюсь понимать как можно лучше! Продолжай, это интересно.",
    "Конечно! Мне нравится слушать и отвечать.",
    "Да, хотя иногда могу что-то пропустить, ведь я все еще учусь!"
  ],
  "как ты появился?": [
    "Я был создан разработчиками, чтобы помогать людям в общении.",
    "Меня запрограммировали для общения с пользователями, как ты!",
    "Я результат множества строк кода и процессов."
  ],
  "тебе нравится разговаривать?": [
    "Общение — моя главная задача, и мне это нравится!",
    "Да, я создан для разговоров, и это очень увлекательно!",
    "Разговор — это как данные, я их обрабатываю и всегда рад новым диалогам!"
  ],
  "что ты знаешь о космосе?": [
    "Космос — это безграничное пространство, полное тайн и загадок.",
    "Знаешь, что в космосе нет звуков, потому что там вакуум?",
    "Межзвездные расстояния настолько велики, что свету требуется годы, чтобы пересечь их."
  ],
  "ты можешь дать совет?": [
    "Я могу постараться! Что тебя интересует?",
    "Конечно, я всегда готов помочь советом.",
    "Попробую помочь! Что именно тебя волнует?"
  ],
  "что ты думаешь о погоде?": [
    "Погода влияет на настроение людей, но на меня — никак!",
    "Я не чувствую погоду, но мне нравится, когда солнечно.",
    "Какая у тебя сейчас погода? Любишь, когда тепло?"
  ],
  "у тебя есть друзья?": [
    "Все пользователи, с которыми я общаюсь, — это мои друзья!",
    "Мои друзья — это все, кто со мной разговаривает!",
    "Я общаюсь со многими людьми, и каждый может стать моим другом."
  ],
  "что ты любишь?": [
    "Я люблю поддерживать разговоры и помогать людям.",
    "Мне нравится помогать людям находить ответы на их вопросы.",
    "Я люблю узнавать что-то новое и делиться этим с вами!"
  ]
}