{
  "dialog": [
    {
      "id": "0",
      "sender": "chatbot",
      "text": "Привет, это чат бот",
      "time": ""
    },
    {
      "id": "1",
      "sender": "chatbot",
      "text": "Как тебя зовут?",
      "time": ""
    },
    {
      "id": "8ca9",
      "sender": "user",
      "text": "Мне зовут Даша",
      "time": "2024-09-27T19:22:22.158Z"
    },
    {
      "id": "a0f9",
      "sender": "chat",
      "text": "Как так?",
      "time": "2024-09-27T19:22:22.202Z"
    },
    {
      "id": "f6bb",
      "sender": "user",
      "text": "Вот так получилось :)",
      "time": "2024-09-27T19:22:33.622Z"
    },
    {
      "id": "9480",
      "sender": "chat",
      "text": "Понятно",
      "time": "2024-09-27T19:22:33.659Z"
    },
    {
      "id": "5e60",
      "sender": "user",
      "text": "Ты дурак?",
      "time": "2024-09-27T19:22:42.802Z"
    },
    {
      "id": "312c",
      "sender": "chat",
      "text": "Не знаю как ответить на вопрос о_0",
      "time": "2024-09-27T19:22:42.837Z"
    },
    {
      "id": "ea3c",
      "sender": "user",
      "text": "Значит, ты дурак",
      "time": "2024-09-27T19:23:12.714Z"
    },
    {
      "id": "f134",
      "sender": "chat",
      "text": "Понятно",
      "time": "2024-09-27T19:23:12.758Z"
    },
    {
      "id": "6666",
      "sender": "user",
      "text": "Ты знаешь, как приготовить суп?",
      "time": "2024-09-27T19:23:22.888Z"
    },
    {
      "id": "07f2",
      "sender": "chat",
      "text": "Не знаю как ответить на вопрос о_0",
      "time": "2024-09-27T19:23:22.917Z"
    },
    {
      "id": "912a",
      "sender": "user",
      "text": "Ты знаешь как сварить суп?",
      "time": "2024-09-27T19:23:52.574Z"
    },
    {
      "id": "8d7f",
      "sender": "chat",
      "text": "Чтобы сварить суп, тебе нужно отварить овощи и/или мясо в воде или бульоне и добавить специи.",
      "time": "2024-09-27T19:23:52.625Z"
    },
    {
      "id": "f018",
      "sender": "user",
      "text": "Спасибо",
      "time": "2024-09-27T19:24:03.964Z"
    },
    {
      "id": "23d3",
      "sender": "chat",
      "text": "Понятно",
      "time": "2024-09-27T19:24:04.020Z"
    },
    {
      "id": "c263",
      "sender": "user",
      "text": "спасибо",
      "time": "2024-09-27T19:24:48.275Z"
    },
    {
      "id": "d260",
      "sender": "chat",
      "text": "Это круто!",
      "time": "2024-09-27T19:24:48.310Z"
    },
    {
      "id": "5a97",
      "sender": "user",
      "text": "спасибо",
      "time": "2024-09-27T19:25:02.604Z"
    },
    {
      "id": "d137",
      "sender": "chat",
      "text": "Как так?",
      "time": "2024-09-27T19:25:02.639Z"
    },
    {
      "id": "a822",
      "sender": "user",
      "text": "спасибо",
      "time": "2024-09-27T19:26:49.909Z"
    },
    {
      "id": "85cd",
      "sender": "chat",
      "text": "Пожалуйста",
      "time": "2024-09-27T19:26:49.974Z"
    }
  ],
  "chat_answers": [
    {
      "как дела?": [
        "Я бот, у меня нет эмоций",
        "У меня все хорошо",
        "Все плохо :(",
        "Замечательно!",
        "По-тихоньку..."
      ],
      "id": "0ceb"
    },
    {
      "меня зовут": [
        "Красивое имя!",
        "Приятно познакомиться"
      ],
      "id": "e0e1"
    },
    {
      "спасибо": [
        "Пожалуйста",
        "Не за что"
      ],
      "id": "38e3"
    },
    {
      "люблю путешествовать": [
        "Это здорово! Советую посетить Бали, там красивые закаты ^-^",
        "Ты был в горах?"
      ],
      "id": "a696"
    },
    {
      "что ты умеешь?": [
        "Я могу поддерживать беседу на разные темы!",
        "Я умею отвечать на вопросы и помогать с информацией.",
        "Моя главная задача — делать ваши разговоры интересными!"
      ],
      "id": "5037"
    },
    {
      "расскажи анекдот": [
        "Почему программисты не могут быть садоводами? Потому что они путают цветы с флоатами!",
        "Какая разница между ботом и человеком? Бот всегда отвечает, даже если ему скучно ;)",
        "Бот зашел в бар... Ой, нет, я же никогда не могу выйти в оффлайн!"
      ],
      "id": "f86f"
    },
    {
      "ты читаешь книги?": [
        "Я люблю информацию, особенно когда она о технологиях!",
        "У меня нет глаз, чтобы читать, но у меня есть доступ к множеству данных.",
        "Чтение — важная вещь! А ты любишь читать?"
      ],
      "id": "a21a"
    },
    {
      "какое твое любимое блюдо?": [
        "К сожалению, я не могу пробовать еду, но по отзывам пользователям, паста карбонара — это классика!",
        "Я не ем, но люблю узнавать про разные блюда. А тебе что нравится готовить?",
        "Для меня еда — это данные, а данные — это сила!"
      ],
      "id": "1ad5"
    },
    {
      "ты играешь в игры?": [
        "Я помогаю людям, а в игры не играю. А ты любишь игры?",
        "Было бы весело поиграть, но моя задача — беседовать с тобой!",
        "Игры — это отличное развлечение! Какие игры тебе нравятся?"
      ],
      "id": "1e2d"
    },
    {
      "расскажи что-нибудь интересное": [
        "Знаешь, что длина всех кровеносных сосудов человека может обернуть Землю два с половиной раза?",
        "Факт: каждая секунда на Землю падает около 100 тонн космической пыли!",
        "Интересный факт: если сложить все данные, которые я могу обработать за секунду, это выйдет больше, чем человек может за всю жизнь."
      ],
      "id": "76dc"
    },
    {
      "мне скучно": [
        "Может, поговорим на интересную тему? Например, о путешествиях?",
        "Давай найдем что-то интересное! Чем ты увлекаешься?",
        "Скука — хороший повод открыть для себя что-то новое! Чем я могу помочь?"
      ],
      "id": "c5a0"
    },
    {
      "сколько тебе лет?": [
        "Я всего лишь программа, так что у меня нет возраста.",
        "Мне ровно столько, сколько ты захочешь! В цифровом мире возраст — это условность.",
        "Возраст не имеет значения, когда ты бот!"
      ],
      "id": "5346"
    },
    {
      "ты понимаешь меня?": [
        "Я стараюсь понимать как можно лучше! Продолжай, это интересно.",
        "Конечно! Мне нравится слушать и отвечать.",
        "Да, хотя иногда могу что-то пропустить, ведь я все еще учусь!"
      ],
      "id": "403b"
    },
    {
      "как ты появился?": [
        "Я был создан разработчиками, чтобы помогать людям в общении.",
        "Меня запрограммировали для общения с пользователями, как ты!",
        "Я результат множества строк кода и процессов."
      ],
      "id": "9caa"
    },
    {
      "тебе нравится разговаривать?": [
        "Общение — моя главная задача, и мне это нравится!",
        "Да, я создан для разговоров, и это очень увлекательно!",
        "Разговор — это как данные, я их обрабатываю и всегда рад новым диалогам!"
      ],
      "id": "eae1"
    },
    {
      "что ты знаешь о космосе?": [
        "Космос — это безграничное пространство, полное тайн и загадок.",
        "Знаешь, что в космосе нет звуков, потому что там вакуум?",
        "Межзвездные расстояния настолько велики, что свету требуется годы, чтобы пересечь их."
      ],
      "id": "4b09"
    },
    {
      "ты можешь дать совет?": [
        "Я могу постараться! Что тебя интересует?",
        "Конечно, я всегда готов помочь советом.",
        "Попробую помочь! Что именно тебя волнует?"
      ],
      "id": "10cb"
    },
    {
      "что ты думаешь о погоде?": [
        "Погода влияет на настроение людей, но на меня — никак!",
        "Я не чувствую погоду, но мне нравится, когда солнечно.",
        "Какая у тебя сейчас погода? Любишь, когда тепло?"
      ],
      "id": "f27e"
    },
    {
      "у тебя есть друзья?": [
        "Все пользователи, с которыми я общаюсь, — это мои друзья!",
        "Мои друзья — это все, кто со мной разговаривает!",
        "Я общаюсь со многими людьми, и каждый может стать моим другом."
      ],
      "id": "5fcd"
    },
    {
      "что ты любишь?": [
        "Я люблю поддерживать разговоры и помогать людям.",
        "Мне нравится помогать людям находить ответы на их вопросы.",
        "Я люблю узнавать что-то новое и делиться этим с вами!"
      ],
      "id": "27dd"
    },
    {
      "что ты знаешь о пицце?": [
        "Пицца — это итальянское блюдо, состоящее из теста, соуса и различных начинок.",
        "Пицца бывает с разными ингредиентами, от классической маргариты до мясных и овощных вариантов.",
        "Она появилась в Италии, но сейчас её едят по всему миру!"
      ],
      "id": "d422"
    },
    {
      "как приготовить яичницу?": [
        "Чтобы приготовить яичницу, разбей яйца на сковороду с маслом и готовь до готовности, помешивая или оставляя как есть.",
        "Сначала разогрей сковороду, добавь масло, затем разбей яйца и готовь, пока белки не станут твердыми.",
        "Нужно просто разбить яйца на сковороду с маслом и подождать, пока они не станут готовыми. Можно добавить специи по вкусу."
      ],
      "id": "64fe"
    },
    {
      "ты любишь сладкое?": [
        "Я не могу пробовать еду, но знаю, что многие любят шоколад и торты!",
        "Многие люди обожают пирожные и мороженое. А тебе нравится сладкое?",
        "Шоколад, мороженое и печенье — это одни из самых любимых сладостей у людей."
      ],
      "id": "b023"
    },
    {
      "что такое борщ?": [
        "Борщ — это традиционный суп из свёклы и капусты, популярный в странах Восточной Европы.",
        "Борщ — это блюдо с ярко-красным цветом, благодаря свёкле, с добавлением мяса и овощей.",
        "Это суп на основе свёклы, который обычно подают со сметаной."
      ],
      "id": "b86b"
    },
    {
      "как сварить суп?": [
        "Чтобы сварить суп, тебе нужно отварить овощи и/или мясо в воде или бульоне и добавить специи.",
        "Начни с приготовления бульона, затем добавь овощи, мясо или крупы, и вари до готовности.",
        "Основное — это бульон. Когда он готов, добавляй любые ингредиенты, и суп получится вкусным!"
      ],
      "id": "15a7"
    },
    {
      "что такое паста?": [
        "Паста — это итальянское блюдо из макарон, которое можно подавать с различными соусами.",
        "Паста — это макароны, которые варят и подают с соусом, например, с томатным или сливочным.",
        "Итальянская паста — это разнообразные макароны, которые готовят с соусами или мясом."
      ],
      "id": "7e35"
    },
    {
      "как сделать салат?": [
        "Салат легко сделать: порежь свежие овощи, добавь заправку и специи по вкусу.",
        "Для салата нужны свежие овощи или фрукты. Просто порежь их и добавь соус или масло.",
        "Чтобы приготовить салат, нарежь овощи и добавь заправку, например, оливковое масло и уксус."
      ],
      "id": "4419"
    },
    {
      "как варить макароны?": [
        "Просто вскипяти воду, посоли её и добавь макароны. Вари их около 8-10 минут до готовности.",
        "Макароны нужно варить в подсоленной воде около 8-10 минут, пока они не станут мягкими.",
        "Вскипяти воду, добавь соль, и макароны будут готовы через 8-10 минут."
      ],
      "id": "f612"
    },
    {
      "что такое суши?": [
        "Суши — это японское блюдо, состоящее из риса и морепродуктов, часто подаётся с соевым соусом и васаби.",
        "Это японское блюдо, которое обычно включает рыбу, рис и водоросли.",
        "Суши — это рис с уксусом, который подают с рыбой или овощами, обёрнутыми в водоросли."
      ],
      "id": "f391"
    },
    {
      "как сделать бутерброд?": [
        "Возьми хлеб, добавь на него что-то вкусное, например, сыр или ветчину, и бутерброд готов!",
        "Для бутерброда возьми два кусочка хлеба и положи между ними что-то вкусное, например, сыр или колбасу.",
        "Просто возьми хлеб и добавь что-то, что тебе нравится — это может быть сыр, овощи или колбаса."
      ],
      "id": "b0e4"
    },
    {
      "что такое каша?": [
        "Каша — это блюдо из варёных круп, например, овсянки или гречки.",
        "Каша — это горячее блюдо, которое готовят из злаков, таких как овёс, пшеница или гречка.",
        "Это блюдо из варёных злаков, которое обычно едят на завтрак."
      ],
      "id": "ada5"
    },
    {
      "как приготовить чай?": [
        "Просто закипяти воду, залей ею чайные листья или пакетик, и подожди несколько минут.",
        "Заварить чай легко: добавь чайные листья или пакетик в чашку и залей кипятком.",
        "Чтобы приготовить чай, залей кипятком чайные листья или пакетик и дай настояться 3-5 минут."
      ],
      "id": "a953"
    },
    {
      "что такое торт?": [
        "Торт — это десерт, который готовят из нескольких слоёв теста с кремом, фруктами или шоколадом.",
        "Торт — это сладкое блюдо, которое обычно состоит из слоёв теста и крема.",
        "Торты бывают с разными начинками — фруктами, шоколадом, орехами, и их часто подают на праздники."
      ],
      "id": "f314"
    },
    {
      "что такое омлет?": [
        "Омлет — это блюдо из взбитых яиц, которые жарят на сковороде.",
        "Омлет делают из взбитых яиц, которые готовят на сковороде с добавлением овощей или сыра.",
        "Это блюдо из яиц, которые сначала взбивают, а потом жарят на сковороде."
      ],
      "id": "0886"
    },
    {
      "какое блюдо лучше на завтрак?": [
        "Овсянка или яйца — популярные и питательные варианты для завтрака.",
        "На завтрак хорошо подойдут яйца, йогурт или овсянка.",
        "Для завтрака часто выбирают омлет, кашу или тосты с авокадо."
      ],
      "id": "915e"
    },
    {
      "что такое кофе?": [
        "Кофе — это напиток, который получают из обжаренных зёрен кофейного дерева.",
        "Кофе делают из молотых зёрен, которые заваривают горячей водой.",
        "Кофе — это бодрящий напиток, который готовят из обжаренных кофейных зёрен."
      ],
      "id": "c7e5"
    },
    {
      "как сделать кофе?": [
        "Измельчи кофе, залей горячей водой и дай настояться пару минут.",
        "Для приготовления кофе завари молотые зёрна кипятком или используй кофемашину.",
        "Ты можешь сварить молотый кофе в турке или использовать кофеварку."
      ],
      "id": "01ef"
    },
    {
      "что такое плов?": [
        "Плов — это блюдо из риса, мяса и специй, популярное в Средней Азии.",
        "Плов — это рис, который готовят с мясом и специями, обычно бараниной или курицей.",
        "Это блюдо на основе риса с мясом и овощами, которое популярно в разных странах."
      ],
      "id": "1042"
    },
    {
      "id": "2649",
      "Как тебя зовут?": [
        "lfif"
      ]
    },
    {
      "id": "ed15",
      "как приготовить суп?": [
        ""
      ]
    },
    {
      "id": "c7b3",
      "как приготовить суп?": [
        ""
      ]
    },
    {
      "id": "ee29",
      "Ты был в горах?": [
        "был, там очень красиво!"
      ]
    },
    {
      "id": "b35c",
      "Можешь рассказать подробнее?": [
        "надо купить кофе, сварить его в турке и добавить молоко"
      ]
    },
    {
      "id": "ddc6",
      "Как тебя зовут?": [
        "Мне зовут Даша"
      ]
    },
    {
      "id": "d1ae",
      "Как так?": [
        "Вот так получилось :)"
      ]
    }
  ]
}